/**
 * Created by qyc on 2017/5/18.
 */
var png=getUrlParams("png");
if(png){
    var arr=[{
        "a":["5095mm车长，2970mm轴距，尽展浩然之风。后掠的前端生动而富含张力，颀长的侧裙板动感十足，尾部宽厚有度，散发不言而喻的豪迈与稳健。",
            "红旗H7以开阔的设计格局，满足您对驾乘体验的全部想象，更有细致入微的人性化科技，实现超乎所想的全感官奢华享受。",
            "前后排座椅均具备通风功能，驾乘者随时拥有可调节的舒适感受。后排座椅更专属配备按摩功能，同时可实现多角度的自由调节，让身心尽皆舒展放松；更以独有的打孔皮设计，令驾乘者在享受加热功能同时，背部感受到更加舒爽的通风感觉。"],
        "b":["理想之美","从容有度","奢适备至"],
        "c":["红旗H7 2.0T 豪华","现售价：280800.00元"]
    },{
        "a":["秉承日产北美设计的四门轿跑（4DSC）基因，以GTR式悬浮车顶，勾勒赛道之魂。",
            "配备4DSC驾控性能套件及公路稳行系统一键转换运动模式，点燃弯道激情。",
            "环绕式战斗机座舱设计，法式双缝线工艺，专享剧院级音效，尽显豪华品质感。"],
        "b":["魅力造型","精准驾控","风尚空间"],
        "c":["日产西玛 2.5L XV至尊版","现售价：228800.00元"]
    },{
        "a":["人车合一的驾控体验，让你的每一次出行都充满激情。",
            "每一次驾驶，都应该是一次梦想中的惬意感受。",
            "当冰冷的科技遇到人性化设计，生活将被注入新的温度。"],
        "b":["豪华配置","舒适体验","先进科技"],
        "c":["GS4 235T 1.5T手动两驱豪华版","现售价：114500.00元"]
    },{
        "a":["在流面切割造型的基础上，优化视觉比例，令整车重心扎实稳健。每一处细节都精雕细琢，彰显高品质运动型SUV风范。",
            "以飞机涡轮引擎为灵感设计的出风口造型，圆润饱满。",
            "Autohold自动驻车使驾驶员在不需要长时间刹车，以及启动电子驻车制动的情况下，也能够避免车辆不必要的滑行。"],
        "b":["全新运动型","飞机涡轮","自动驻车"],
        "c":["名爵17款GS 2.0T 四驱旗舰(骑士黑)","现售价：156800.00元"]
    },{
        "a":["inkaNet 4G智能网络行车系统,Loetsch第二代全息数字仪表盘,,12键多功能方向盘,同级最大8英寸触控屏,大灯自动点亮. 。",
            "全新一代蓝芯20T高效动力科技,7速TST智能双离合变速器,EPS电动助力转向系统,Start-Stop发动机智能启停系统,运动型真皮换挡手柄,欧洲级悬挂调校。",
            "发动机一键启动,欧洲级强化型USD车身结构,全方位SCS智能安全控制系统,SRS六方位一体式安全气囊,防潜滑高强骨架座椅,前排未系报警/预紧限力式安全带,膝部碰撞保护,二向可调多级溃缩转向柱,360°优化行车视野。"],
        "b":["科技","动力","安全"],
        "c":["荣威360 360自动豪华(17款)","现售价：77900.00元"]
    },{
        "a":["低速行车安全系统,大尺寸轮胎,智能自适应巡航控制。",
            "告别繁复的操作，轻松驾驭你的出色旅程。新一代SYNC®3，配备8英寸大屏，支持手写输入、手势缩放；语音识别再度优化，还增配AppLinkTM及苹果CarPlayTM功能。智能化驾乘体验，让探索随心所欲。",
            "电动开启大面积的天窗，与家人一道仰望天空的蔚蓝，也感受灿烂阳光、新鲜空气带来的惬意。可以全幅打开的遮阳帘和隐私玻璃，在保护私密性的同时也提升舒适度。"],
        "b":["全局防护","智慧科技","全景天窗"],
        "c":["福特翼虎 EcoBoost180 四驱豪翼型","现售价：199800.00元"]
    },{
        "a":["凌厉电眼，狂放的大尺寸镀铬进气格栅，趣野必备的外挂式备胎，特别设计的侧开门后备厢也干净利落，无不表露出硬派作风和不驯天性，它同样挑剔一位有趣冒险精神的车主拍档。",
            "SYNC® 实现人车对话，通过蓝牙或USB链接移动／多媒体设备。只需简单的语言指令，就可以轻松实现语音拨号、声控音乐播放、语音播报短信，实时日不离路，手不离方向盘，保证正常驾驶，提高行车安全。特别具备终身免费的紧急呼叫救援功能，在发生事故时自动启动紧急呼叫救援服务并发送GPS定位信息。SYNC® 独有的福特AppLink™可在驾驶途中，通过语音指令操控，将您与您最喜爱的手机应用程序相联（福特AppLink™仅适用于部分福特车型）。",
            "安全没有借口，持“硬派”安全理念的翼搏对此毫不含糊。超级配备ABS防抱死系统、TCS牵引力控制系统、ESC车身电子稳定控制系统、EBA紧急制动辅助系统、EBD电子制动力分配系统、自动落锁等多项主动智能安全配置，又有HSA坡道起步辅助系统与后泊车雷达的周密关照，6安全气囊再加高强度吸能安全车身的坚实屏障，确保趣冒险，一路有趣无险！"],
        "b":["野性外露","言听计从","安全第一"],
        "c":["福特翼博 1.5L自动尊贵型","现售价：103800.00元"]
    },{
        "a":["新BMW X1的多功能性和动态性恰到好处地诠释了SAV的外观特征。无论是在市区还是越野驾驶，其强健的侧面轮廓、长轴距以及短前后悬都给人留下了深刻印象。极具动感的设计与紧凑的外部尺寸完美结合，并拥有两排座椅与更具灵活性的宽敞空间。高品质材料与一体化饰件的巧妙搭配令新BMW X1的外观更加出众。",
            "新BMW X1的驾驶者辅助系统。一系列驾驶辅助功能可为您提供可靠的支持。它们可始终确保较大的安全性和舒适性，令您专注于享受纯粹的驾驶乐趣。",
            "新BMW X1是您探索未知的理想伙伴，升高的座椅提供了更好的驾乘视野，同时优质材料更打造出舒适的内部环境。凭借直观的操控性和灵活可变的空间组合，新BMW X1将助您实现丰富多彩的未来计划。"],
        "b":["惊艳呈现","值得信赖","探索未知"],
        "c":["宝马X1 18Li尊享版","现售价：272700.00元"]
    },{
        "a":["不喧哗，不浮夸，基于根本，专注本源。",
            "不征服，不改变，基于根本，互敬平衡。",
            "不追逐，不冲动，基于根本，坚守原则。"],
        "b":["动于心","动极速","动安心"],
        "c":["现代领动 手动智炫青春型","现售价：79800.00元"]
    },{
        "a":["CS15继承长安独有的设计语言，原创性凌厉前格栅彰显非常规硬派气质，与动感蓄势车体的设计语言融为一体，毫不含蓄的展露其锋芒与灵动。",
            "长安CS15强悍动力系统锋芒毕露，随时助力你的激情释放。新一代的高效能发动机， 完美体现高效低耗的典范。EPS电子转向助力加之长安精心调教的变速系统， 动能分配随心所驭。释放激情动力，领略多彩风景。",
            "长安汽车始终秉承科技为人所享的理念，汲取现代科技技术，以人性化智能为核心， 打造CS15 in Call智能车载互联系统，让智能为你所享。"],
        "b":["“颜出必型”","“激情动力”","“舒适便捷”"],
        "c":["长安CS15 手动尊贵","现售价：65900.00元"]
    }];


    var bigContent=document.querySelector("#scroll");
    var bigxiding=document.querySelector("#xiding");
    var xiding="";
    var detailsImg="";
    xiding+="<div class='detailsPrice background-color-fff'>";
    xiding+="<p class='color-orange  mui-text-center'>";
    xiding+="<span>"+arr[png-11].c[0]+"</span><br/><span>"+arr[png-11].c[1]+"</span></p>";
    xiding+="<div class='mui-btn-blue  mui-text-center'>";
    xiding+="<a href='tel:4000290916'>立即预约<br/>400-029-0916</a></div></div>";

    detailsImg+="<div class='detailsImg' style='padding: 0'>";
    detailsImg+="<img src='../dist/images/img"+png+".png'>";
    detailsImg+="<div class='detailsPrice background-color-fff'>";
    detailsImg+="<p class='color-orange  mui-text-center'>"+arr[png-11].c[1]+"</p>";
    detailsImg+="<div class='mui-btn-blue  mui-text-center'>";
    detailsImg+="<a href='tel:4000290916'>立即预约<br/>400-029-0916</a></div></div>";

var li="";
//if(img==5){
//    img=4
//}else if(img==8){
//    img=7;
//}
    for(var j=0;j<arr[png-11].a.length;j++){
        li+="<li class='mui-table-view-cell'><div class='detailsTitle'><hr class='fl hr'/>";
        li+="<p class='fl mui-text-center'>"+arr[png-11].b[j]+"</p>";
        li+="<hr class='fl hr'/></div>";
        li+="<p style='text-indent:2em; padding: 0 0 15px 0'>"+arr[png-11].a[j]+"</p>";
        li+="<img class='deImg' src='../dist/images/"+png+"-"+j+".png'></li>";
    }
    var ulList="<ul class='mui-table-view mui-list-unstyled margin-top5'>"+li+"</ul>";
    var content="<div class='mui-scroll'>"+detailsImg+ulList+"</div>";
    bigContent.innerHTML=content;
    bigxiding.innerHTML=xiding;

}

//js获取url参数
function getUrlParams(name, url) {
    if (!url) url = window.location.href;
    var params = {};
    var url = decodeURI(url);
    var idx = url.indexOf("?");
    if (idx > 0) {
        var queryStr = url.substring(idx + 1);
        var args = queryStr.split("&");
        for (var i = 0, a, nv; a = args[i]; i++) {
            nv = args[i] = a.split("=");
            params[nv[0]] = nv.length > 1 ? nv[1] : true;
        }
    }
    return params[name];
}